# Part 1 - Data Processing

## Data Processing is the foundation to any Machine Learning Model

<ul>
    <li> Independent Variables (attributes)
    <li> Dependent Variables (attributes)
</ul>
<br>
We will do the Data Processing Process in ALL Machine Learning Models

Lets take a look at the data

## We will be using Three Libraries

The Libraries we will be using
<ul>
    <li> numpy
    <li> matplotlib.pyplot
    <li> pandas
    <li> sklearn
</ul>

In [1]:
# install pandas library
!pip install pandas
!pip install numpy
!pip install matplotlib
!pip install sklearn

Requirement already satisfied: pandas in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (1.4.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from pandas) (1.22.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Requirement already satisfied: numpy in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (1.22.2)
Requirement already satisfied: matplotlib in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (3.5.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from matplotlib) (9.0.1)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from matplotlib) (4.29.1)
Requirement already satisfied: cycler>=0.10 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from matplotlib) (3.0.6)
Requirement already satisfied: packaging>=20.0 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from matplotlib) (21.3)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from matplotlib) (1.3.2)
Requirement already satisfied: numpy>=1.17 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from matplotlib) (1.22.2)
Requirement already satisfied: six>=1.5 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Collecting sklearn
  Using cached sklearn-0.0.tar.gz (1.1 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Collecting scikit-learn
  Using cached scikit_learn-1.0.2-cp310-cp310-win_amd64.whl (7.2 MB)
Requirement already satisfied: numpy>=1.14.6 in c:\users\school\anaconda3\envs\python3_10\lib\site-packages (from scikit-learn->sklearn) (1.22.2)
Collecting scipy>=1.1.0
  Using cached scipy-1.8.0-cp310-cp310-win_amd64.whl (37.0 MB)
Collecting joblib>=0.11
  Using cached joblib-1.1.0-py2.py3-none-any.whl (306 kB)
Collecting threadpoolctl>=2.0.0
  Using cached threadpoolctl-3.1.0-py3-none-any.whl (14 kB)
Building wheels for collected packages: sklearn
  Building wheel for sklearn (setup.py): started
  Building wheel for sklearn (setup.py): finished with status 'done'
  Created wheel for sklearn: filename=sklearn-0.0-py2.py3-none-any.whl size=1309 sha256=859759ff3977ac21f66372a0b742c4e53517899b1ac4a2a72a65ab8c723f7462
  Stored in directory: c:\users\school\appdata\local\pip\cache\wheels\9b\13\01\6f3a7fd641f90e1f6c8c7cded057f3394f451f340371c68f3d
Successfully built sklearn
Installing collected packages: threadpoolctl, scipy, joblib, scikit-learn, sklearn
Successfully installed joblib-1.1.0 scikit-learn-1.0.2 scipy-1.8.0 sklearn-0.0 threadpoolctl-3.1.0

In [63]:
# import pandas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [64]:
# load the data
df=pd.read_csv("Data.csv")

In [65]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

<b>We have 3 Independent Attributes and 1 Dependent Attribute</b><br>
Country, Age and Salary are Independent Attributes and Purchased is Dependet on the 3 Independent Variables (attributes)<br><br>
In this exercise, we want to predict if the Customer Purchased a Product or not

 ### Create a Matrix of the three Independent Variables (Features)

In [66]:
X = df.iloc[:, :-1].values
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

### create a matrix for the 1 dependent Variable

In [67]:
y = df.iloc[:, -1].values
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

## Prepare the Data

In [68]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

<b> we have two missing datas.</b>
<ul>
    <li> Age for Spain
    <li> Salary for Germany
</ul>

### How do we fix this problem?

<ul>
    <li> we can remove the row/object
    <li> can set NaN to 0
    </ul>

### Method 1 ( Remove the rows  with NaN values)

In [69]:
# can drop the NaN values
# dangerious to drop an observation
df_no_nan = df.dropna()
df_no_nan

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [70]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

### Method 2 
#### Import Sklearn to replace the NaN values with "mean, median, or most frequent"

In [71]:
# Most common approch. Take the mean of the columns and replace the NaN with MEAN
from sklearn.impute import SimpleImputer

imp_mean = SimpleImputer(missing_values=np.nan, strategy="mean")
imp_mean.fit(X[:, 1:3])
X[:,1:3] = imp_mean.transform(X[:,1:3])

In [72]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

#### Or, we can use Pandas with data frames

In [74]:
df.fillna(value=df[["Age","Salary"]].mean())

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes